import math
# Завдання №1 ###############################################################################
print("Завдання №1:\n")
# Введення значень x, μ та σ
x = float(input("Введіть значення x: "))
mu = float(input("Введіть значення μ (середнє значення): "))
sigma = float(input("Введіть значення σ (стандартне відхилення): "))

# Обчислення значення функції Гауса
result = 1 / (sigma * math.sqrt(2 * math.pi)) * math.exp(-((x - mu) ** 2) / (2 * sigma ** 2))

# Виведення результату
print(f"Значення функції Гауса для x = {x}, μ = {mu}, σ = {sigma}: {result}")

# Завдання №2 ###############################################################################
print("\nЗавдання №2:\n")
john = 3
mary = 5
adam = 6

print(john, mary, adam, sep=",")
total_apples = john + mary + adam
print("Загальна кількість яблук:", total_apples)

# Завдання №3 ###############################################################################
print("\nЗавдання №3:\n")
km = 12.25
mil = 7.38

mil_to_km = mil * 1.61
km_to_mil = km / 1.61

print(mil, "miles is", round(mil_to_km, 2), "kilometers")
print(km, "kilometers is", round(km_to_mil, 2), "mil")

# Завдання №4 ###############################################################################
print("\nЗавдання №4:\n")
# Введення значення x як плаваючого числа
x = float(input("Введіть значення x: "))

# Обчислення значення виразу
y = 3 * x**3 - 2 * x**2 + 3**x - 1

print("y =", y)

# Завдання №5 ###############################################################################
print("\nЗавдання №5:\n")
hours = 2
seconds = 3600

print("Seconds in", hours,"hours:", hours * seconds)

# Завдання №6 ###############################################################################
print("\nЗавдання №6:\n")
a = float(input("Введіть перше число: "))
b = float(input("Введіть друге число: "))

print(f"Додавання: {a} + {b} = ", a + b)
print(f"Віднімання: {a} - {b} = ", a - b)
print(f"Множення: {a} * {b} = ", a * b)
if (b == 0):
    print(f"На нуль ділити неможна!")
else:
    print(f"Ділення: {a} / {b} = ", a / b)

# Завдання №7 ###############################################################################
print("\nЗавдання №7:\n")
x = float(input("Введіть значеення x: "))
y= 1 / (x + (1 / (x + (1 / (x + (1 / (x + (1 / x))))))))
print("y =", y)

# Завдання №8 ###############################################################################
print("\nЗавдання №8:\n")
hour = int(input("Starting time (hours): "))
mins = int(input("Starting time (minutes): "))
dura = int(input("Event duration (minutes): "))

end_mins = mins + dura

hour += end_mins // 60
end_mins = end_mins % 60

hour = hour % 24

print(hour, ":", end_mins, sep="")